#+BLOG: iocanel.com
#+POSTID: 463
#+BLOG: iocanel.com
#+DATE: [2018-09-12 Wed 12:22]
#+BLOG: iocanel.com
#+ORG2BLOG:
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil
#+TITLE: Service Catalog: Introduction
#+DESCRIPTION: An introduction to the service catalog
#+CATEGORY: Development
#+TAGS: Kubernetes, Service Catalog

* Overview
This is the first of a series of posts around the [[https://svc-cat.io][service catalog]]. The end goal is to demonstrate how the [[https://svc-cat.io][service catalog]]
 can simplify building apps on [[https://kubernetes.io][kubernetes]] and [[https://openshift.com][openshift]].

The first part will cover:
- why
- how to install
- how to use

The target environment will be [[https://openshift.com][openshift]] 3.10 on Linux using `oc cluster up` for development purposes.

* Introduction
  
Working with [[https://kubernetes.io][kubernetes]] since its early days, there are countless of times where I had to go into creating manifests for the services my application is using.
By services I am referring to things like databases, messaging systems, or any other pieces of third party software my application might need.

Each time, the process is the same:

- Find a suitable docker image.
- Search for matching manifests.
- Try out.
- Rinse and repeat.

And even when all things are in place I have to find a way of letting my application know `how to connect` to the service.
And of course, this only applies to services that are running `side by side` with the application. 

What about external services?

The [[https://svc-cat.io][service catalog]] is a solution that brings service brokers as defined by the [[https://www.openservicebrokerapi.org][open service broker api]] to [[https://kubernetes.io][kubernetes]].

It provides a couple of new kind of resources that define:

- service broker
- service types
- service instances
- service bindings

If you want to familiarize yourself with the purpose of those, please check the qm
  
* Preparation

  To manipulate the [[https://svc-cat.io][service catalog]] resources from the command line you will need the [[https://svc-cat.io][service catalog]] client.

** The service catalog client
   
   You will need to `svcat` binary to interact with the catalog from the command line.
   
   On my linux machine this can be done:

   #+BEGIN_SRC shell
     curl -sLO https://download.svcat.sh/cli/latest/linux/amd64/svcat
     chmod +x ./svcat
     mv ./svcat /usr/local/bin/
     svcat version --client
   #+END_SRC
   
   Full instructions (for all operating systems) can be found in the [[https://svc-cat.io/docs/install/#installing-the-service-catalog-cli][service catalog installation guide]].
   
** Preparing the environment
   
*** Installing the service catalog

    I will be using for [[https://openshift.com][openshift]] 3.10 which I'll start directly using:

    #+BEGIN_SRC shell
      oc cluster up
      oc login -u system:admin                                                                                                         
    #+END_SRC
    
    Then I just need to add the service catalog and a broker:

    #+BEGIN_SRC shell
      oc cluster add service-catalog
      oc cluster add automation-service-broker
    #+END_SRC
    
*** Validating the setup

    To make sure everything is fine let's list the available brokers:

    #+BEGIN_SRC shell
      svcat get brokers
    #+END_SRC

    #+RESULTS:
    | NAME                                | NAMESPACE                                                                                                                     | URL   | STATUS |
    | +-----------------------------------|                                                                                                                               |       |        |
    | openshift-automation-service-broker | https://openshift-automation-service-broker.openshift-automation-service-broker.svc:1338/openshift-automation-service-broker/ | Ready |        |
    
    The output should contain `openshift-automation-broker`.

*** Provision a service:

    Now, lets create the database. I'll be using [[https://www.microsoft.com/en-us/sql-server/sql-server-2017][microsoft sql server]]. So let's see what the broker we installed has to offer:

    #+BEGIN_SRC shell
      svcat get plans | grep mssql 
    #+END_SRC

    #+RESULTS:
    | default                                                                                 | dh-mssql-remote-apb | 
    | https://www.mssqltips.com/sqlservertip/2428/sql-server-2012-contained-database-feature/ |                     |
    | persistent                                                                              | dh-mssql-apb        |
    | ephemeral                                                                               | dh-mssql-apb        |
    
    If not obvious, this will list all the available classes and plans for ms sql server (classes refer to the service type and plan refers to the different flavors e.g. persistent). 
    
    #+BEGIN_SRC shell
      svcat provision --class dh-mssql-apb --plan ephemeral mymssql
    #+END_SRC

    #+RESULTS:
    | Name:       | mymssql      |         |
    | Namespace:  | myproject    |         |
    | Status:     |              |         |
    | Class:      | dh-mssql-apb |         |
    | Plan:       | ephemeral    |         |
    |             |              |         |
    | Parameters: |              |         |
    | No          | parameters   | defined |
    
    Our database should be provisioned soon. Now all we need to do is to create a binding that our application will use to connect to the service.
    
*** Binding to the service

    #+BEGIN_SRC shell
      svcat bind mymssql
    #+END_SRC

    #+RESULTS:
    | Name:       | mymssql    |         |
    | Namespace:  | myproject  |         |
    | Status:     |            |         |
    | Secret:     | mymssql    |         |
    | Instance:   | mymssql    |         |
    |             |            |         |
    | Parameters: |            |         |
    | No          | parameters | defined |

What this actually does is that it create a new `Secret` with all the connection information and it also creates a `ServiceBinding` which binds the instance we created with the secret.
Any piece of code that needs to connect to the service we created can use the secret (in whatever way its preferable).

In the next part of this series we will introduce you to a tool that allows [[https://spring.io/projects/spring-boot][spring boot]] applications to automagically connect to [[https://svc-cat.io][service catalog]] managed services.

Stay tuned !  
